#Код, который oпределяет плавучий ли объект или нет

def Archimed(density):  #вызываем функцию 
    if density > 1:  #если плотность больше 1
        print("Объект не плавучий")  #выводим результат
    else:  #если плотность меньше 1
        print("Объект плавучий")  #выводим результат
    if density == 1:  #если плотность равна 1
        print("Объект частично плавучий")  #выводим результат

def main():#вызов функции main
    m = float(input("Введите массу тела: "))#вводим массу тела
    v = float(input("Введите объём погружённой части объекта: "))#вводим объём погружнной части
    density = float(input("Введите плотность: "))#вводим плотность объекта
    Archimed(density)# вызов функции


if __name__ == '__main__':
    main()  
