#Импортируем модули

import pyramid
import Archimed

def main():#вызываем функцию
    mod = input('Если  хотите узнать, является ли объект плавучим, введите 1, если вы хотите найти объём усеченной пирамиды введите 2: ')
    if mod.lower() == '1':#если введено 1
        Archimed.main() #вызываем модуль для архимеда
        main() 
    
    elif mod.lower() == '2':#если введено 2
        pyramid.main() #вызываем модуль для пирамиды
        main() 
   
    else:#если введено другое число
        return 1 #выходим из функции


if __name__ == '__main__':
    main()