# код, который вычисляет объём усечённой пирамиды, зная площадь верхнего и нижнего оснований и высоту

def piramid(S_up, S_down, h):#вызываем функцию с 3-мя перемнными
    V = (h/3)*(S_up +(S_up*S_down)**(1/2)+S_down) #вычисляем объём
    return V# возвращаем значение объма


def main():# вызов функции main
    h = float(input("Введите высоту: "))#вводим значение высоты с клавиатуры и преобразуем его в значение float
    S_up = float(input("Введите площадь верхнего основания: "))#вводим значение площади верхнего основания и преобразуем его в значение float
    S_down = float(input("Введите площадь нижнего основания: "))#вводим значение площади нижнего основания и преобразуем его в значение float
    result = piramid(h,S_up,S_down)#вызываем функцию с введенными пользователем значениями
    print("Объем усеченной пирамиды: ",int(result) )#выводим результат


if __name__ == '__main__':
    main()   